package com.university.kolos2022.task2;

public class Task2 {
   /* Напишите программу для записи зачетов группы студентов. Студент описан через имя и фамилию.
   Зачет описан через пару оценка и предмет. Зачет каждого студента записывается в отдельном «множестве» .
   Полями класса Зачеты является объект Студент и множество его зачетов. Зачеты группы студентов поместить в массив(ArrayList<Зачеты>).
    Написать необходимые классы, конструкторы и  вспомогательные методы, такие как toString, equals, compareTo, compare,
     возможность обработки зачетов для группы студентов. В главном классе проработать следующие методы:
            - добавление нового студента
- вписание зачета студенту по данному предмету
- вывод списка студентов по алфавиту
- вывод по алфавиту списка предметов, зачтеных как минимум одним человеком.
- список зачетов данного студента(предметы, оценки), упорядоченная по предметамю
- списки зачетов всех студентов по алфавиту по именам и фамилиям, а после по предметам.
- вывод средней оценки данного студента
- счет средней оценки с выбранного предмета
- в отдельном классе продемонстрировать работу программы
    Внимание! Студент может иметь только 1 оценку по каждому предмету, предмет всегда идет парой с оценкой.

    1) класс Студент, класс Зачет и класс Успеваемость(поля студент и его зачеты)
    2) comparable для студентов, сортировка по фамилиям
    3)!!!!!компортатор для класса успеваемость, сортировка по среднему баллу
    */


}
