package com.university.kolos2023.task1;

public class Task1 {
    /*Задание 1
Написать программу для записи на компакт диски. Диск имеет номер каталога и состоит из песен описанных через заголовок,
автора и год выпуска. Автор описан через имя и фамилию. Для записи песен на диске
Используется массив, и для записи  - сборник. Те же самые песни могут повторятся на разных дисках.
Реализовать следующие функции:
a) вывод песен с выбранного диска в порядке записи( сортировка по году),
b) вывод песен по алфавиту со всех дисков (по названию)(без повторений),
c) вывод по алфавиту песен данного автора с выбранного диска (вызываю метод сортировки из пункта а),
d) вывод по алфавиту всех песен данного автора(тоже самое)(без повторений),
e) вывод по алфавиту всех авторов с выбранного диска(как с, но без автора),
f) вывод по алфавиту всех авторов(сортировка авторов),
Написать необходимые методы для эффективной реализации задания, в том числе toString, equals, методы интерфейсов Comparable/Comparator.?
Напишите отдельные методы, вычисляющие и возвращающие результаты, и методы, отображающие переданную им коллекцию.
Внимание:
Poszczególne wydruki poprzedzić odpowiednim tytułem, np. Lista alfabetyczna kompozytorów:
Poszczególne pozycje, poprzedzone numerem porządkowym, wyświetlić w osobnych wierszach.
Zastosować różne sposoby przechodzenia po kolekcjach, w tym iterator.

К каждому выводу добавить соответствующий заголовок, например Алфавитный список композиторов:
Отображайте отдельные элементы, которым предшествует порядковый номер, в отдельных строках.
Используйте различные способы перемещения по коллекциям, включая итератор.?

Продемонстрировать работу программы.

*/
}
