package com.university.kolos.task3;

public class Task3 {
   /* Внедрить стратегию расчета вознаграждения сотрудников.
    Сотрудник описывается фамилией, именем и способом вознаграждения.
    Возможны различные способы оплаты труда в зависимости от вида занятости.
    Их следует выделить в отдельные классы, позволяющие рассчитывать вознаграждение.
    Для сотрудников, работающих полный рабочий день, вознаграждение рассчитывается как
    ежемесячная заработная плата плюс премия (выраженная в процентах). Для работающих
    по договору поручения оплата рассчитывается исходя из количества заказанных часов и почасовой ставки.
            Класс «Сотрудник» помимо конструктора должен содержать метод, возвращающий
    /отображающий результат, и метод, позволяющий изменить способ оплаты труда сотрудника.
    Продемонстрируйте программу в тестовом классе .
    Part1
    Создать  абстрактный класс сотрудник и наследующие от него классы
    (Сотрудники на полный рабочий день и сотрудники по договору)
    Part2
    в классе сотрудник создать конструктор
    необходимые поля
    абстрактный метод, который будет считать зарплату
    и метод, возвращающий результат
    Геттеры и сеттеры
    метод туСтринг
    Part3
    в классе Сотрудник на прд создать поля( плата, премия)
    в классе Сотрудник по договору создать поля(часы работы и ставка)
    Part4
    в классе Тестер продемонстрировать работу программы

        */


   public static void main(String[] args) {

   }


}
